print('Задача 6. Замечательные числа')

# Напишите программу,
# которая находит и выводит все двузначные числа,
# которые равны утроенному произведению своих цифр.
# К таким относятся, например, 15 и 24.

# Пояснение:
# 15 -> 1*5*3 = 15 - получившееся число равно оригиналу, значит число надо вывести
# 16 -> 1*6*3 = 18 - число выводить не нужно, 18 не равно 16

for digit1 in range(1, 10):
    for digit2 in range(10):
        num = 10 * digit1 + digit2
        num_tridig = 3 * digit1 * digit2
        if num == num_tridig:
            print(num)
