print('Задача 6. НОД')

#Напишите функцию, вычисляющую наибольший общий делитель двух чисел
